// Пример демонстрирует отложенный запуск функции с параметром
// Одна и та же функция запускается через 1, 2 и 3 секунды после старта с разными параметрами
#include "SoftTimerAdvance.h"

// Буфер для хранения таймеров
uint8_t t_buff[1024];
// Менеджер таймеров
SoftTimerManager ST;
//параметры для передачи в функцию
int p1 = 1;
int p2 = 2;
int p3 = 3;

// Функция отложенного запуска, принимает указатель на параметр
void DelayFunc(void *_Prm)
{
  //конвертируем указать в int и получаем значение по адресу
  int p = *((int *)_Prm);
  //выводим значение параметра
  Serial.println(p);
}

void setup() {
  Serial.begin(115200);

  // Инициализация менеджера таймеров
  ST.Init(t_buff, sizeof(t_buff));

  // Инициализируем отложенные запуски после старта программы
  ST.AddDelayCall(DelayFunc, &p1, 1000);// через 1000 мс, передаётся параметр p1
  ST.AddDelayCall(DelayFunc, &p2, 2000);// через 2000 мс, передаётся параметр p2
  ST.AddDelayCall(DelayFunc, &p3, 3000);// через 3000 мс, передаётся параметр p3
}

void loop() {
  // Работа менеджера таймеров в бесконечном цикле, в ней он вызывает отложенные запуски
  ST.Update(millis());
}
