// Пример демонстрирует, как узнать время до следующего срабатывания таймера
// Update возвращает это время в миллисекундах. Его можно использовать, чтобы не крутить loop впустую
// В примере на это время вызывается delay, на реальном устройстве вместо него можно усыпить процессор
#include "SoftTimerAdvance.h"

// Буфер для хранения таймеров
uint8_t t_buff[1024];
// Менеджер таймеров
SoftTimerManager ST;

// Функция таймера, вызывается раз в секунду
void Timer1sec()
{
  Serial.println("1sec");
}

void setup() {
  Serial.begin(115200);

  // Инициализация менеджера таймеров
  ST.Init(t_buff, sizeof(t_buff));

  // Инициализируем таймер
  ST.AddTimer(Timer1sec, 1000);// Период 1000 мс
}

void loop() {
  // Работа менеджера таймеров. Возвращает время до следующего срабатывания таймера в миллисекундах
  // 0 означает, что есть таймер, готовый к запуску, и ждать нельзя
  uint32_t time_to_next = ST.Update(millis());

  if (time_to_next > 0)
  {
    Serial.print("Wait, ms: ");
    Serial.println(time_to_next);
    delay(time_to_next);
  }
}
