// Пример демонстрирует внеочередной вызов таймера из прерывания
// Таймер выводит сообщение раз в 10 секунд. Нажатие кнопки вызывает прерывание,
// после которого функция таймера выполняется сразу, но не в прерывании, а в основном цикле
// Так из прерывания можно запускать долгую работу, не задерживая само прерывание
#include "SoftTimerAdvance.h"

// Пин кнопки, кнопка замыкает его на землю. Пин должен поддерживать прерывания (на Arduino Uno это 2 и 3)
#ifdef ESP32
const int BUTTON_PIN = 4;
#else
const int BUTTON_PIN = 2;
#endif

// Буфер для хранения таймеров
uint8_t t_buff[1024];
// Менеджер таймеров
SoftTimerManager ST;
// Интерфейс управления таймером
STimer *Timer1 = 0;

// Функция таймера, вызывается раз в 10 сек. и сразу после нажатия кнопки
void Work()
{
  Serial.println("Work");
}

// Обработчик прерывания, вызывается при нажатии кнопки
void ButtonISR()
{
  // Просим вызвать таймер как можно быстрее. Вызов произойдёт при ближайшем ST.Update
  Timer1->ForceCallFromISR();
}

void setup() {
  Serial.begin(115200);
  pinMode(BUTTON_PIN, INPUT_PULLUP);

  // Инициализация менеджера таймеров
  ST.Init(t_buff, sizeof(t_buff));

  // Инициализируем таймер
  Timer1 = ST.AddTimer(Work, 10, STUnits::Seconds);// Период 10 сек

  // Подключаем прерывание по нажатию кнопки. Таймер к этому моменту уже должен быть создан
  attachInterrupt(digitalPinToInterrupt(BUTTON_PIN), ButtonISR, FALLING);
}

void loop() {
  // Работа менеджера таймеров в бесконечном цикле, здесь же выполняются действия, запрошенные из прерываний
  ST.Update(millis());
}
