// Пример демонстрирует базовую работу с тасками / псевдопотоками
// В примере создаётся задержка после старта программы 1000 мс и 5 сек, а также 1000 мс после пятисекундной задержки
#include "SoftTimerAdvance.h"

// Буфер для хранения таймеров
uint8_t t_buff[1024];
// Менеджер таймеров
SoftTimerManager ST;

// Переменная для хранения таска
STTask Task1;
// Функция таска, должна обязательно принимать указатель с именем "Task"
void TaskFunc(STTask* Task)
{
  // Переменные внутри таска должны быть статическими, т.к. при вызове Delay происходит выход и повторный заход в функцию
  static int i = 0;
  // Макрос начала таска
  TaskBegin();
  Serial.println("Task start");
  for (i = 0; i < 10; i++)
  {
    Serial.println(i);
    // Макрос паузы в таске в миллисекундах. В этот момент происходит выход из функции и повторный вход с прыжком в это место
    TaskDelay(1000);
  };
  Serial.println("Task end");
  // Макрос конца таска
  TaskEnd();
}

void setup() {
  Serial.begin(115200);

  // Инициализация менеджера таймеров, возвращает количество таймеров, которое помещается в буфер
  ST.Init(t_buff, sizeof(t_buff));

  // Инициализация и запуск таска
  Task1.Start((PrmFuncST)TaskFunc, &ST);
}

void loop() {
  // Работа менеджера таймеров в бесконечном цикле, в ней он вызывает отложенные запуски
  ST.Update(millis());
}