// Пример демонстрирует измерение загрузки процессора функциями таймеров
// Таймер раз в 100 мс работает около 20 мс, то есть занимает около 20% времени
// Раз в 3 секунды загрузка выводится в порт
#include "SoftTimerAdvance.h"

// Буфер для хранения таймеров
uint8_t t_buff[1024];
// Менеджер таймеров
SoftTimerManager ST;

// Функция таймера, вызывается раз в 100 миллисек. и работает около 20 мс
void Work()
{
  delay(20);
}

// Функция таймера, раз в 3 секунды выводит загрузку процессора
void PrintLoad()
{
  // CPULoad - доля времени в процентах, которую заняли функции таймеров. Обновляется раз в 3 секунды
  Serial.print("CPU load, %: ");
  Serial.println(ST.Telemetry.CPULoad);
}

void setup() {
  Serial.begin(115200);

  // Инициализация менеджера таймеров
  ST.Init(t_buff, sizeof(t_buff));

  // Телеметрии нужно время в микросекундах, указываем функцию micros. Выполняется после Init
  ST.Telemetry.GetMicros = micros;

  // Инициализируем таймеры
  ST.AddTimer(Work, 100);// Период 100 мс
  ST.AddTimer(PrintLoad, 3, STUnits::Seconds);// Период 3 сек
}

void loop() {
  // Работа менеджера таймеров в бесконечном цикле, в ней он вызывает таймеры
  ST.Update(millis());
}
