// Пример демонстрирует режим таймера STMode::Restart
// В этом режиме период отсчитывается от момента вызова, поэтому между вызовами проходит не меньше периода
// Опоздания не компенсируются: если программа занята, таймер срабатывает реже
// В примере loop задерживается на 30 мс, из-за этого таймер с периодом 100 мс каждый раз опаздывает
// В режиме Restart получается меньше 10 вызовов в секунду, в режиме по умолчанию было бы ровно 10
#include "SoftTimerAdvance.h"

// Буфер для хранения таймеров
uint8_t t_buff[1024];
// Менеджер таймеров
SoftTimerManager ST;
// Интерфейс управления таймером
STimer *Timer1 = 0;

// Счётчик вызовов таймера
int counter = 0;

// Функция таймера 1, вызывается раз в 100 миллисек.
void Tick()
{
  counter++;
}

// Функция таймера 2, вызывается раз в секунду
void Timer1sec()
{
  Serial.print("Calls per second: ");
  Serial.println(counter);
  counter = 0;
}

void setup() {
  Serial.begin(115200);

  // Инициализация менеджера таймеров
  ST.Init(t_buff, sizeof(t_buff));

  // Инициализируем таймеры
  Timer1 = ST.AddTimer(Tick, 100);// Период 100 мс
  ST.AddTimer(Timer1sec, 1000);// Период 1000 мс

  // Включаем режим Restart. Уберите эту строку, чтобы сравнить с режимом по умолчанию
  Timer1->SetMode(STMode::Restart);
}

void loop() {
  // Работа менеджера таймеров в бесконечном цикле, в ней он вызывает таймеры
  ST.Update(millis());

  // Имитация занятой программы
  delay(30);
}
