// Пример демонстрирует внеочередной вызов таймера
// Таймер выводит сообщение раз в 10 секунд. Любой символ, отправленный в монитор порта,
// вызывает функцию таймера сразу, не дожидаясь конца периода
#include "SoftTimerAdvance.h"

// Буфер для хранения таймеров
uint8_t t_buff[1024];
// Менеджер таймеров
SoftTimerManager ST;
// Интерфейс управления таймером
STimer *Timer1 = 0;

// Функция таймера, вызывается раз в 10 сек.
void Timer10sec()
{
  Serial.println("10sec");
}

void setup() {
  Serial.begin(115200);

  // Инициализация менеджера таймеров
  ST.Init(t_buff, sizeof(t_buff));

  // Инициализируем таймер
  Timer1 = ST.AddTimer(Timer10sec, 10, STUnits::Seconds);// Период 10 сек
}

void loop() {
  // Работа менеджера таймеров в бесконечном цикле, в ней он вызывает таймеры
  ST.Update(millis());

  // Принят символ, вызываем таймер как можно быстрее. Следующий вызов будет через полный период
  if (Serial.available())
  {
    Serial.read();
    Timer1->ForceCall();
  }
}
