// Пример демонстрирует строгий режим таймера STMode::Strict
// В этом режиме вызовы, которые не успели выполниться вовремя, копятся и выполняются подряд
// Общее количество вызовов сохраняется, это удобно для подсчёта времени или шагов
// Первый таймер раз в 200 мс выводит время, второй раз в 5 секунд занимает программу на 1 секунду
// После паузы первый таймер сразу вызывается 5 раз подряд, навёрстывая пропущенное
#include "SoftTimerAdvance.h"

// Буфер для хранения таймеров
uint8_t t_buff[1024];
// Менеджер таймеров
SoftTimerManager ST;
// Интерфейс управления таймером
STimer *Timer1 = 0;

// Функция таймера 1, вызывается раз в 200 миллисек.
void Tick()
{
  Serial.print("tick ");
  Serial.println(millis());
}

// Функция таймера 2, вызывается раз в 5 сек. и работает 1 секунду
void LongWork()
{
  Serial.println("Long work 1 sec");
  delay(1000);
}

void setup() {
  Serial.begin(115200);

  // Инициализация менеджера таймеров
  ST.Init(t_buff, sizeof(t_buff));

  // Инициализируем таймеры
  Timer1 = ST.AddTimer(Tick, 200);// Период 200 мс
  ST.AddTimer(LongWork, 5, STUnits::Seconds);// Период 5 сек

  // Включаем строгий режим: пропущенные вызовы будут выполнены
  Timer1->SetMode(STMode::Strict);
}

void loop() {
  // Работа менеджера таймеров в бесконечном цикле, в ней он вызывает таймеры
  ST.Update(millis());
}
