// Пример демонстрирует базовую работу с тасками / псевдопотоками
// Таск - это функция, которая может делать паузы, не останавливая остальную программу
// В примере таск 10 раз выводит число с паузой в 1 секунду и завершается
#include "SoftTimerAdvance.h"

// Буфер для хранения таймеров
uint8_t t_buff[1024];
// Менеджер таймеров
SoftTimerManager ST;

// Переменная для хранения таска
STTask Task1;
// Функция таска, должна обязательно принимать указатель с именем "Task"
void TaskFunc(STTask* Task)
{
  // Переменные внутри таска должны быть статическими, т.к. при вызове Delay происходит выход и повторный заход в функцию
  static int i = 0;
  // Макрос начала таска
  TaskBegin();
  Serial.println("Task start");
  for (i = 0; i < 10; i++)
  {
    Serial.println(i);
    // Макрос паузы в таске в миллисекундах. В этот момент происходит выход из функции и повторный вход с прыжком в это место
    TaskDelay(1000);
  };
  Serial.println("Task end");
  // Макрос конца таска
  TaskEnd();
}

void setup() {
  Serial.begin(115200);

  // Инициализация менеджера таймеров, возвращает количество таймеров, которое помещается в буфер
  ST.Init(t_buff, sizeof(t_buff));

  // Инициализация и запуск таска, возвращает код ошибки (например, если в буфере нет места для таймера)
  if (Task1.Start((PrmFuncST)TaskFunc, &ST) != STTaskResult::Ok)
    Serial.println("Task start error");
}

void loop() {
  // Работа менеджера таймеров в бесконечном цикле, в ней он вызывает отложенные запуски
  ST.Update(millis());
}